In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussel_londOn'],
                  'FlightNumber':[10045,np.nan,10065,np.nan, 10085],
                  'RecentDelays':[[23,47],[],[24,43,87],[13],[16,32]],
                  'Airline':['KLM(!)','<Air France> (12)','(British Airways. )','12. Air France','''Swiss Air''']})

In [3]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4    Brussel_londOn       10085.0      [16, 32]            Swiss Air

**1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [4]:
df.iloc[1,1] = df.iloc[0,1]+10
df.iloc[3,1] = df.iloc[2,1]+10
df.FlightNumber = df.FlightNumber.astype(int)

**2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [5]:
From = df['From_To'].apply(lambda x : x.split('_')[0])
To = df['From_To'].apply(lambda x : x.split('_')[1])

**3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)**

In [7]:
From = From.str.title()
To = To.str.title()

**4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [10]:
df.drop('From_To', axis=1,inplace=True)
df['From'] = From
df['To'] = To

**5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.**

In [45]:
df.head()

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [16, 32]            Swiss Air   Brussel     London